{
    "title":"Legend of Grundelduff",
    "chapter":
        {
            "prologue": "Once opun a time, there was a mage called Grundelduff, who set out for a grand adventure, so he left his house. What should he do next?",
            "alternatives":
                [
                    {
                      "description": "Return inside. There was no point leaving the house in this weather",
                      "chapter":
                        {
                            "prologue": "He entered his home sweet home and locked the door. All his courage and his thirst for adventure were gone.",
                            "alternatives":[]
                        }  
                    },
                    {
                        "description": "Go for a walk into the forest.",
                        "chapter":
                          {
                              "prologue": "When he arrived in the woods he suddenly noticed a strange elf with huge ... ears. Should Grundelduff come closer?",
                              "alternatives":
                              [
                                  {
                                      "description": "Sure, he could definitely ask him to join his adventure.",
                                      "chapter":
                                      {
                                          "prologue": "When Grundelduff approached the elf and asked him to join his trip, the elf got extremely scared. Not only was he surprised but also irritated by the suspicious offer, since he did not even know Grundelduff. The rumors about Gurndelduff's intentions spread quickly in the forest. Soon nobody wanted to talk to him any longer. He disappointedly returned back home and locked himself inside.",
                                          "alternatives":[]
                                      }
                                  },
                                  {
                                    "description": "With his extremely large ears, Grundelduff could call him funny names.",
                                    "chapter":
                                    {
                                        "prologue": "Surprisingly, the elf happened to be quite flattered by the names. He gave Grundelduff a paper which he suspiciously called 'key'. It said: \"PeanutButterJelly\". Even though Grundelduff didn't understand the meaning, it somehow made him really happy.",
                                        "alternatives": []
                                    }
                                },
                                {
                                    "description": "Grundelduff should escape from this scary creature immediately. Nobody knows what elves are up to.",
                                    "chapter":
                                    {
                                        "prologue": "While running, Grundelduff tripped over a stone and fell into a tar pit. Completely covered by a slimy black liquid Grundelduff had to admit to himself that his adventure had been a complete failure.",
                                        "alternatives": []
                                    }
                                }
                              ]
                          }  
                    },
                    {
                        "description": "Go into town to meet other people.",
                        "chapter":
                          {
                              "prologue": "Grundelduff headed downtown, but after he had arrived, he quickly realized that the presence of a mage was not really appreciated in the town. On the contrary, people seemed to be very hostile, so after a lot of frustrating hours he came back to his house and locked himself inside.",
                              "alternatives":[]
                          }  
                      }
                ]
        }
}